code-review/NRB_3471_3546/База_Было/Catalogs/ВидыКорпоративныхДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыКорпоративныхДействий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКорпоративныхДействий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУведомления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКорпоративныхДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКорпоративныхДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добровольное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обязательное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобровольноеИнструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/ВидыКорпоративныхДействий/Ext/ManagerModule.bsl
// Возвращает элемент справочника "INTR"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКорпоративныхДействий
//
Функция INTR() Экспорт
	Возврат НайтиПоКоду("INTR");
КонецФункции

// Возвращает элемент справочника "DVCA"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКорпоративныхДействий
//
Функция DVCA() Экспорт
	Возврат НайтиПоКоду("DVCA");
КонецФункции

// Возвращает элемент справочника "WTRC"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКорпоративныхДействий
//
Функция WTRC() Экспорт
	Возврат НайтиПоКоду("WTRC");
КонецФункции

// Возвращает элемент справочника "MCAL"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКорпоративныхДействий
//
Функция MCAL() Экспорт
	Возврат НайтиПоКоду("MCAL");
КонецФункции

// Возвращает элемент справочника "CAPG"
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКорпоративныхДействий
//
Функция CAPG() Экспорт
	Возврат НайтиПоКоду("CAPG");
КонецФункции

// Возвращает виды КД РСВ, которые необходимо отражать в журналах входящих и исходящих
// 
// Возвращаемое значение:
//  Массив - виды КД
//
Функция ВидыКДРСВДляЖурналовВходящихИсходящих() Экспорт
	
	ВидыКД = Новый Массив;
	ВидыКД.Добавить(НайтиПоКоду("DSCL"));
	ВидыКД.Добавить(НайтиПоКоду("OTHR"));
	
	Возврат ВидыКД;
	
КонецФункции

// Возвращает истину если тип вида корпоративного действия Доходы.
//
// Параметры:
//  ВидКорпоративногоДействия	 - СправочникСсылка.ВидыКорпоративныхДействий, Строка, 	 - ссылка на элемент справочника или код вида корпоративного действия
// 
// Возвращаемое значение:
//  Булево 
//
Функция ЭтоКорпоративноедействиеДоходы(ВидКорпоративногоДействия) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКорпоративныхДействий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКорпоративныхДействий КАК ВидыКорпоративныхДействий
	|ГДЕ
	|	ВидыКорпоративныхДействий.ТипКорпоративныхДействий = &ТипКорпоративныхДействийДоход
	|	И НЕ ВидыКорпоративныхДействий.ПометкаУдаления
	|	И &УсловиеОтбора");
	
	Если ТипЗнч(ВидКорпоративногоДействия) = Тип("Строка") Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", "ВидыКорпоративныхДействий.Код = &УсловиеОтбора");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", "ВидыКорпоративныхДействий.Ссылка = &УсловиеОтбора");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипКорпоративныхДействийДоход", Перечисления.ТипыКорпоративныхДействий.Доход);
	Запрос.УстановитьПараметр("УсловиеОтбора", ВидКорпоративногоДействия);
	
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции
